app/controllers/scenarios_controller.rb

SELECT * FROM "scenarios" WHERE ("scenarios"."id" = 298486374 AND ("scenarios".project_id = 298486374))
---
  def index
    sort_init 'name', 'asc'
    sort_update %w(name updated_at)

    case params[:format]
    when 'xml', 'json'
      @offset, @limit = api_offset_and_limit
    else
      @limit = per_page_option
    end

    @scenario_count = @scenarios.count;
    @project_id = params[:project_id]
    @scenarios_pages = Paginator.new self, @scenario_count, @limit, params['page']
    @offset ||= @scenarios_pages.current.offset
    @scenarios_show = Scenario.find :all,
                                    :conditions => "project_id = " + @project.id.to_s,
                                    :order => sort_clause,
                                    :limit  =>  @limit,
                                    :offset =>  @offset

SELECT * FROM "scenarios" WHERE ("scenarios".project_id = 298486374)
---
  def show
    @scenario = Scenario.find(params[:id])

SELECT * FROM "scenarios" WHERE ("scenarios".project_id = 298486374)
SELECT * FROM "networks"
---
  def edit
    if(params[:scenario_id] != nil)
      @scenario = Scenario.find(params[:scenario_id])
    else
      @scenario = Scenario.new
    end

    if(Scenario.find_by_project_id(@project).network == nil)
      @prompt_network = {:prompt => 'Create a Network'}
      @nets = [];
    else
      @prompt_network = {:prompt => 'Please Select'}
      @nets = Scenario.find_by_project_id(@project).network.sort_by(&:description);
    end
    @controls = [];
    @events = [];
    if(@nets.empty?)

SELECT * FROM "projects" WHERE ("projects"."id" = 298486374)
INSERT INTO "scenarios" ("name", "capacity_profile_group_id", "created_at", "b_time", "project_id", "network_id", "split_ratio_profile_group_id", "updated_at", "dt", "length_units", "e_time", "description", "v_types", "demand_profile_group_id") VALUES('Scenario 3', NULL, '2011-01-30 22:41:24', 12.0, NULL, NULL, NULL, '2011-01-30 22:41:24', 12.0, '10', 1.0, 'Three', 'Hello', NULL)
---
  def create
    @project = Project.find(params[:project_id])
    @scenario = Scenario.new(params[:scenario])
    @scenario.project_id = @project.id

    respond_to do |format|
      if(@scenario.save)

SELECT * FROM "scenarios" WHERE ("scenarios".project_id = 298486374)
UPDATE "scenarios" SET "updated_at" = '2011-01-31 08:31:00', "name" = 'Scenario 12' WHERE "id" = 980190975
---
  def update
    @scenario = Scenario.find(params[:scenario_id])

    respond_to do |format|
      if(@scenario.update_attributes(params[:scenario]))

SELECT * FROM "projects" WHERE ("projects"."id" = 298486374)
SELECT * FROM "scenarios" WHERE ("scenarios".project_id = 298486374)
DELETE FROM "scenarios" WHERE "id" = 298486374
---
  def delete_all
    @project = Project.find(params[:project_id])
    @scenarios = @project.scenarios.all

    @scenarios.each do | s |
      s.destroy